from collections import OrderedDict

value_range = {
    "是否":["是", "否"],
    "字段原文" : str,
    "借贷关系角色" : ["出借人（原告）", "借款人（被告）", "担保人（被告）", "其他诉讼参与人"],
    "借款次数情况" : ["单笔借款", "完全不区分的多笔借款", "完全区分的多笔借款", "不全区分的多笔借款", "将利息计入本金的新借款"],
    "案件复杂情况" : ["普通借贷案件", "复杂借贷案件"],
    "代理人员角色类型" : ["委托代理人", "法人代表"],
    "字符串列表" : [str],
    "数值" : int,       # 从0开始
    "字符串" : str,
    "日期值" : str,       # 待定义
    "金额性质": [
        "本金",
        "利息",
        "逾期利息",
        "违约金"
    ],
    "起始日期类型": [
        "借款合同订立日",
        "借款实际交付日",
        "利息冲抵日",
        "起诉日",
        "借款合同订立日&借款实际交付日",
        "无息借款到期日",
        "本判决确定的给付之日",
        "立案日",
        "分期付款违约日",
        "重新确认债权债务之日"
    ],
    "截止日期类型": [
        "约定支付本息日",
        "起诉日",
        "实际履行完毕日",
        "暂算日",
        "诉状送达日",
        "本判决确定给付之日"
    ],
    "金额" : int,       #（元）
    "利率类型": [
        "年利率",
        "年利息",
        "月利率",
        "月利息",
        "日利率",
        "日利息",
        "中国人民银行同期同档次贷款基准利率",
        "贷款市场报价利率(LPR)",
        "中国人民银行同期同档次贷款基准利率的四倍",
        "贷款市场报价利率(LPR)的四倍",
        "同国家规定/司法保护上限",
        "借款额的占比",
        "约定的数额（固定数额）",
        "年固定分红",
        "月固定分红",
        "日固定分红"
    ],
    "率数值": str,          #"率类型": "年利率，是指借贷双方直接约定每年需支付的利息率，如“每年按照借款的24%支付利率”、“每年按照借款的0.24支付利率”，输入“24%”\n年利息，是指借贷双方直接约定每年需支付的利息总额，如“每年支付利息2000元”、“每年支付利息2千元”，输入“2000”\n月利率，是指借贷双方直接约定每月需支付的利息率，如“每月按照借款的2%支付利率”、“每月按照借款的0.02支付利率”、“两分利”，输入“2%”\n月利息，是指借贷双方直接约定每年需支付的利息总额，如“每月支付利息200元”、“每月支付利息两百元”，输入“200”\n日利率，是指借贷双方直接约定每月需支付的利息率，如“每日按照借款的0.2%支付利率”、“每日按照借款的千分之二支付利率”，输入“0.2%”\n日利息，是指借贷双方直接约定每日需支付的利息总额，如“每日支付利息1000元”、“每日支付利息一千元”，输入“1000”"
    "担保责任类型": [
        "连带保证责任",
        "一般保证责任",
        "拍卖担保物"
    ],
    "费用类型": [
        "催讨费",
        "差旅费",
        "律师费",
        "保全费"
    ],
    "借款用途": [
        "经营性借贷",
        "消费性借贷",
        "债权受让",
        "债务受让",
        "资金周转",
        "购房购车装修",
        "为他人借款",
        "投资款",
        "其他"
    ],
    "借款人与出借人关系类型": [
        "亲戚",
        "朋友",
        "同事",
        "经亲戚介绍",
        "经朋友介绍",
        "经同事介绍",
        "经第三方平台撮合",
        "房屋租赁关系",
        "同村村民",
        "邻居"
    ],
    "借款凭证类型": [
        "借条",
        "欠条",
        "借款合同",
        "口头",
        "收条",
        "咨询服务协议",
        "债权确认备忘录",
        "合伙协议"
    ],
    "交付方式类型": [
        "银行转账",
        "现金支付",
        "微信支付宝电子转账",
        "信用卡代刷",
        "转账",
        "打款",
        "直接交付第三人",
        "通过第三人交付",
        "通过第三人向第四人交付",
        "以利息计入本金方式交付"
    ],
    "约定程序性费用承担情况类型": [
        "出借人承担",
        "借款人承担",
        "共同承担",
        "违约方承担"
    ],
    "借款次数情况": [
        "单笔借款",
        "完全不区分的多笔借款",
        "完全区分的多笔借款",
        "不完全区分的多笔借款",
        "将利息计入本金的新借款"
    ],
    "约定情况": [
        "口头约定",
        "书面约定",
        "未约定"
    ],
    "案件复杂情况": [
        "普通借贷案件",
        "案情比较复杂",
        "P2P类案件",
        "明股实债"
    ],
    "起诉前后类型": [
        "起诉前",
        "起诉后"
    ],
    "约定还款方式类型": [
        "按月等额偿还",
        "按年等额偿还",
        "按半年等额偿还",
        "按季度等额偿还",
        "到期一次性偿还（到期还本/付息）",
        "期初一次性扣除（砍头息）",
        "按月偿还",
        "按年偿还",
        "按半年偿还",
        "按季度偿还"
    ],
    "已还款总体情况类型": [
        "本金全部未返还【无息借款】",
        "本金部分未返还【无息借款】",
        "本金全部返还、利息全部返还",
        "本金全部返还、利息部分返还",
        "本金全部返还、利息全部未返还",
        "本金部分返还、利息全部返还",
        "本金部分返还、利息部分返还",
        "本金部分返还、利息全部未返还",
        "本金全部未返还、利息全部返还",
        "本金全部未返还、利息部分返还",
        "本金全部未返还、利息全部未返还"
    ],
    "已还款金额性质": [
        "本金",
        "利息",
        "逾期利息",
        "违约金"
    ],
    "担保方式类型": [
        "抵押",
        "质押",
        "保证人"
    ],
    "担保人类型": [
        "个人担保",
        "一般公司企业担保",
        "担保公司担保"
    ],
    "法院对夫妻债务的认定": [
        "属于夫妻共同债务",
        "不属于夫妻共同债务"
    ],
    "法院对砍头息的认定": [
        "存在砍头息",
        "不存在砍头息"
    ],
    "法院对公司为股东担保的效力的认定": [
        "有效",
        "无效"
    ],
    "债权取得类型": [
        "债权受让",
        "债务受让"
    ],
    "法院对主体资格与合同效力的认定": [
        "主体资格使合同无效",
        "主体资格有瑕疵，但合同有效",
        "主体资格无瑕疵"
    ],
    "法院对职业放贷人的认定": [
        "构成职业放贷人",
        "不构成职业放贷人"
    ],
    "承担举证责任方": [
        "借款人",
        "出借人",
        "担保人",
        "法院"
    ],
    "法院对民事案件的处理程序": [
        "继续审理",
        "中止诉讼",
        "驳回起诉"
    ],
} 

Court_determination_attributes = OrderedDict({
    "姓名名称" : value_range["字符串"],
    # 诉讼请求
    "是否变更诉讼请求" : value_range["是否"],
    "需返回本金总额（元）" : value_range["金额"],
    '需返回利息总额（元）' : value_range["金额"],
    '需返回利息计算起始日期' : value_range["日期值"],
    '需返回利息计算起始日期类型' : value_range["起始日期类型"],
    '需返回利息计算截止日期' : value_range["日期值"],
    '需返回利息计算截止日期类型' : value_range["截止日期类型"],
    '需返还利息率类型' : value_range["利率类型"],
    '需返还利息率数值（百分比或元）' : value_range["率数值"],
    '需返回逾期利息总额（元）' : value_range["金额"],
    '需返回逾期利息计算起始日期' : value_range["日期值"],
    '需返回逾期利息计算起始日期类型' : value_range["起始日期类型"],
    '需返回逾期利息计算截止日期' : value_range["日期值"],
    '需返回逾期利息计算截止日期类型' : value_range["截止日期类型"],
    '需返还逾期利息率类型' : value_range["利率类型"],
    '需返还逾期利息率数值（百分比或元）' : value_range["率数值"],
    '需返回违约金总额（元）' : value_range["金额"],
    '需返回违约金计算起始日期' : value_range["日期值"],
    '需返回违约金计算起始日期类型' : value_range["起始日期类型"],
    '需返回违约金计算截止日期' : value_range["日期值"],
    '需返回违约金计算截止日期类型' : value_range["截止日期类型"],
    '需返还违约金类型' : value_range["利率类型"],
    '需返还违约金数值（百分比或元）' : value_range["率数值"],
    '是否要求承担担保责任' : value_range["是否"],
    '承担保证责任的人或单位名称' : value_range["字符串"],
    '保证责任类型' : value_range["担保责任类型"],
    '需返回债权实现费用（起诉前）总额（元）' : value_range["金额"],
    '需返回债权实现费用（起诉前）类型' : value_range["费用类型"],
    '需返回债权实现费用（起诉后）总额（元）' : value_range["金额"],
    '需返回债权实现费用（起诉后）类型' : value_range["费用类型"],
    
    # 借贷事件
    # 借款事实信息
    "借款目的与用途类型" : value_range["借款用途"],
    "借款人与出借人关系类型" : value_range["借款人与出借人关系类型"],
    "担保人的姓名或单位名称" : value_range["字符串"],
    "借款人与担保人关系类型" : value_range["借款人与出借人关系类型"],
    "意思表示日" : value_range["日期值"],
    "借款次数" : value_range["数值"],
    "借款次数情况" : value_range["借款次数情况"],
    "是否有借款凭证" : value_range["是否"],
    # 约定事实信息
    '借款凭证1名称' : value_range["字符串"],
    '借款凭证1类型' : value_range["借款凭证类型"],
    '借款凭证1出具时间' : value_range["日期值"],
    '借款凭证1所载内容' : value_range["字符串"],
    '借款凭证2名称' : value_range["字符串"],
    '借款凭证2类型' : value_range["借款凭证类型"],
    '借款凭证2出具时间' : value_range["日期值"],
    '借款凭证2所载内容' : value_range["字符串"],
    '借款凭证3名称' : value_range["字符串"],
    '借款凭证3类型' : value_range["借款凭证类型"],
    '借款凭证3出具时间' : value_range["日期值"],
    '借款凭证3所载内容' : value_range["字符串"],
    '初始约定的借款金额情况' : value_range["约定情况"],
    '初始约定的实际发生时间' : value_range["日期值"],
    '初始约定的借款金额（元）' : value_range["金额"],
    '第2次约定的借款金额情况' : value_range["约定情况"],
    '第2次约定的实际发生时间' : value_range["日期值"],
    '第2次约定的借款金额（元）' : value_range["金额"],
    '第3次约定的借款金额情况' : value_range["约定情况"],
    '第3次约定的实际发生时间' : value_range["日期值"],
    '第3次约定的借款金额（元）' : value_range["金额"],
    '初始约定的还款日期或借款期限情况' : value_range["约定情况"],
    '初始约定的实际发生时间' : value_range["日期值"],
    '初始约定的借款起始日期' : value_range["日期值"],
    '初始约定的还款日期' : value_range["日期值"],
    '初始约定的借款期限（月）' : value_range["数值"],
    '第2次约定的还款日期或借款期限情况' : value_range["约定情况"],
    '第2次约定的实际发生时间' : value_range["日期值"],
    '第2次约定的借款起始日期' : value_range["日期值"],
    '第2次约定的还款日期' : value_range["日期值"],
    '第2次约定的借款期限（月）' : value_range["数值"],
    '第3次约定的还款日期或借款期限情况' : value_range["约定情况"],
    '第3次约定的实际发生时间' : value_range["日期值"],
    '第3次约定的借款起始日期' : value_range["日期值"],
    '第3次约定的还款日期' : value_range["日期值"],
    '第3次约定的借款期限（月）' : value_range["数值"],
    '初始约定的利息情况' : value_range["约定情况"],
    '初始约定的实际发生时间' : value_range["日期值"],
    '初始约定的利率类型' : value_range["利率类型"],
    '初始约定的利率数值（百分比或元）' : value_range["率数值"],
    '第2次约定的利息情况' : value_range["约定情况"],
    '第2次约定的实际发生时间' : value_range["日期值"],
    '第2次约定的利率类型' : value_range["利率类型"],
    '第2次约定的利率数值（百分比或元）' : value_range["率数值"],
    '第3次约定的利息情况' : value_range["约定情况"],
    '第3次约定的实际发生时间' : value_range["日期值"],
    '第3次约定的利率类型' : value_range["利率类型"],
    '第3次约定的利率数值（百分比或元）' : value_range["率数值"],
    '初始约定的逾期利息情况' : value_range["约定情况"],
    '初始约定的实际发生时间' : value_range["日期值"],
    '初始约定的逾期利率类型' : value_range["利率类型"],
    '初始约定的逾期利率数值（百分比或元）' : value_range["率数值"],
    '第2次约定的逾期利息情况' : value_range["约定情况"],
    '第2次约定的实际发生时间' : value_range["日期值"],
    '第2次约定的逾期利率类型' : value_range["利率类型"],
    '第2次约定的逾期利率数值（百分比或元）' : value_range["率数值"],
    '第3次约定的逾期利息情况' : value_range["约定情况"],
    '第3次约定的实际发生时间' : value_range["日期值"],
    '第3次约定的逾期利率类型' : value_range["利率类型"],
    '第3次约定的逾期利率数值（百分比或元）' : value_range["率数值"],
    '初始约定的违约金情况' : value_range["约定情况"],
    '初始约定的实际发生时间' : value_range["日期值"],
    '初始约定的违约金类型' : value_range["利率类型"],
    '初始约定的违约金数值（百分比或元）' : value_range["率数值"],
    '第2次约定的违约金情况' : value_range["约定情况"],
    '第2次约定的实际发生时间' : value_range["日期值"],
    '第2次约定的违约金类型' : value_range["利率类型"],
    '第2次约定的违约金数值（百分比或元）' : value_range["率数值"],
    '第3次约定的违约金情况' : value_range["约定情况"],
    '第3次约定的实际发生时间' : value_range["日期值"],
    '第3次约定的违约金类型' : value_range["利率类型"],
    '第3次约定的违约金数值（百分比或元）' : value_range["率数值"],
    '管辖约定情况' : value_range["约定情况"],
    '仲裁约定情况' : value_range["约定情况"],
    '程序性费用的承担（律师费、诉讼费等）约定情况' : value_range["约定情况"],
    '约定程序性费用承担情况类型' : value_range["约定程序性费用承担情况类型"],
    '初始约定的还款方式情况' : value_range["约定情况"],
    '初始约定的实际发生时间' : value_range["日期值"],
    '初始约定的本金还款方式' : value_range["约定还款方式类型"],
    '初始约定的利息还款方式' : value_range["约定还款方式类型"],
    '前述还款方式下每次还款总金额（元）' : value_range["金额"],
    '前述还款方式下每次还款日期' : value_range["日期值"],
    '第2次约定的还款方式情况' : value_range["约定情况"],
    '第2次约定的实际发生时间' : value_range["日期值"],
    '第2次约定的本金还款方式' : value_range["约定还款方式类型"],
    '第2次约定的利息还款方式' : value_range["约定还款方式类型"],
    '前述还款方式下每次还款总金额（元）' : value_range["金额"],
    '前述还款方式下每次还款日期' : value_range["日期值"],
    '第3次约定的还款方式情况' : value_range["约定情况"],
    '第3次约定的实际发生时间' : value_range["日期值"],
    '第3次约定的本金还款方式' : value_range["约定还款方式类型"],
    '第3次约定的利息还款方式' : value_range["约定还款方式类型"],
    '前述还款方式下每次还款总金额（元）' : value_range["金额"],
    '前述还款方式下每次还款日期' : value_range["日期值"],
    '初始约定的担保情况' : value_range["约定情况"],
    '初始约定的实际发生时间' : value_range["日期值"],
    '初始约定的担保方式类型' : value_range["担保方式类型"],
    '初始约定的担保范围' : value_range["字符串"],
    '初始约定的担保期限（月）' : value_range["金额"],
    '担保物当下状态' : value_range["字符串"],
    '初始约定的担保人类型' : value_range["担保人类型"],
    '初始约定的保证责任类型' : value_range["担保责任类型"],
    '第2次约定的担保情况' : value_range["约定情况"],
    '第2次约定的实际发生时间' : value_range["日期值"],
    '第2次约定的担保方式类型' : value_range["担保方式类型"],
    '第2次约定的担保范围' : value_range["字符串"],
    '第2次约定的担保期限（月）' : value_range["金额"],
    '担保物当下状态' : value_range["字符串"],
    '第2次约定的担保人类型' : value_range["担保人类型"],
    '第2次约定的保证责任类型' : value_range["担保责任类型"],
    '第3次约定的担保情况' : value_range["约定情况"],
    '第3次约定的实际发生时间' : value_range["日期值"],
    '第3次约定的担保方式类型' : value_range["担保方式类型"],
    '第3次约定的担保范围' : value_range["字符串"],
    '第3次约定的担保期限（月）' : value_range["金额"],
    '担保物当下状态' : value_range["字符串"],
    '第3次约定的担保人类型' : value_range["担保人类型"],
    '第3次约定的保证责任类型' : value_range["担保责任类型"],
    '借款实际交付金额1（元）' : value_range["金额"],
    '借款实际交付时间1' : value_range["日期值"],
    '借款实际交付方式类型1' : value_range["交付方式类型"],
    '借款实际交付1所对应的是第几笔借款' : value_range["数值"],
    '借款实际交付金额2（元）' : value_range["金额"],
    '借款实际交付时间2' : value_range["日期值"],
    '借款实际交付方式类型2' : value_range["交付方式类型"],
    '借款实际交付2所对应的是第几笔借款' : value_range["数值"],
    '借款实际交付金额3（元）' : value_range["金额"],
    '借款实际交付时间3' : value_range["日期值"],
    '借款实际交付方式类型3' : value_range["交付方式类型"],
    '借款实际交付3所对应的是第几笔借款' : value_range["数值"],
    '已还款总体情况类型' : value_range["已还款总体情况类型"],
    '已还款时间1' : value_range["日期值"],
    '已还款金额1（元）' : value_range["金额"],
    '已还款方式1' : value_range["交付方式类型"],
    '已还款金额性质1' : value_range["金额性质"],
    '已还款金额1所对应的是第几笔借款' : value_range["数值"],
    '已还款金额1所冲抵利息至哪一日' : value_range["日期值"],
    '已还款时间2' : value_range["日期值"],
    '已还款金额2（元）' : value_range["金额"],
    '已还款方式2' : value_range["交付方式类型"],
    '已还款金额性质2' : value_range["金额性质"],
    '已还款金额2所对应的是第几笔借款' : value_range["数值"],
    '已还款金额2所冲抵利息至哪一日' : value_range["日期值"],
    '已还款时间3' : value_range["日期值"],
    '已还款金额3（元）' : value_range["金额"],
    '已还款方式3' : value_range["交付方式类型"],
    '已还款金额性质3' : value_range["金额性质"],
    '已还款金额3所对应的是第几笔借款' : value_range["数值"],
    '已还款金额3所冲抵利息至哪一日' : value_range["日期值"],
    # 特殊
    "法院对夫妻债务的认定": value_range["法院对夫妻债务的认定"],
    "法院对砍头息的认定" : value_range["法院对砍头息的认定"],
    "法院对公司为股东担保的效力的认定" : value_range["法院对公司为股东担保的效力的认定"],
    "债权取得类型" : value_range["债权取得类型"],
    "法院对主体资格与合同效力的认定" : value_range["法院对主体资格与合同效力的认定"],
    "法院对职业放贷人的认定" : value_range["法院对职业放贷人的认定"],
    "法院对是否属于互联网平台责任的认定" : value_range["是否"],
    "法院对民事案件的处理程序" : value_range["法院对民事案件的处理程序"],
})

# 日期6+3 = 9；金额7；百分比6=22
cpl_keyword = {
    "需返回本金总额（元）" : { 
        "keyword": ["元"], 
        "warning": "需返回本金总额指的是被告一共需要归还给原告的金额，单位为元，例如若为50万元，需要转换为500000元的形式。"
    },
    '需返回利息总额（元）' : { 
        "keyword": ["元"], 
        "warning": "单位为元，例如若为50万元，需要转换为500000元的形式。"
    },
    '需返回利息计算起始日期' : { 
        "keyword":  ["年", "月", "息"], 
        "warning": "请重点关注上下文中具备年-月-日格式的部分。"
        },
    '需返回利息计算截止日期' : { 
        "keyword":  ["年", "月", "息"], 
        "warning": "请重点关注上下文中具备年-月-日格式的部分。"
    },
    '需返还利息率数值（百分比或元）' : { 
        "keyword": ["%", "息"], 
        "warning": "请重点关注上下文中有%符号后缀的数值。"
    },

    '需返回违约金总额（元）' : { 
        "keyword": ["元", "违约"], 
        "warning": "单位为元，例如若为50万元，需要转换为500000元的形式。不要和本金、利息混淆。"
    },
    '需返回违约金计算起始日期' : { 
        "keyword": ["年", "月", "违约"], 
        "warning": "请重点关注上下文中具备年-月-日格式的部分。不要和本金、利息混淆。"
    },
    '需返回违约金计算截止日期' : { 
        "keyword": ["年", "月", "违约"], 
        "warning": "请重点关注上下文中具备年-月-日格式的部分。不要和本金、利息混淆。"
    },
    '需返还违约金数值（百分比或元）' : { 
        "keyword": ["%", "违约"], 
        "warning": "请重点关注上下文中有%符号后缀的数值。不要和利息率混淆。"
    },

    # 约定事实信息
    '初始约定的借款金额（元）' : { 
        "keyword": ["元"], 
        "warning": "重点是首次约定的借款，不要和实际交付的金额混淆。单位为元，例如若为50万元，需要转换为500000元的形式。"
    },
   
    '初始约定的还款日期' : { 
        "keyword": ["年", "月", "还"], 
        "warning": "请重点关注上下文中具备年-月-日格式的部分。不要和实际归还的日期混淆。"
    },
    
    '初始约定的利率数值（百分比或元）' : { 
        "keyword": ["%", "利率"], 
        "warning": "请重点关注上下文中有%符号后缀的数值。"
    },

    '初始约定的逾期利率数值（百分比或元）' : { 
        "keyword": ["%", "利率"], 
        "warning": "请重点关注上下文中有%符号后缀的数值。很少见，不要和正常利率混淆。"
    },
   
    '初始约定的违约金数值（百分比或元）' : { 
        "keyword": ["%", "违约"], 
        "warning": "请重点关注上下文中有%符号后缀的数值。很少见，不要和利率混淆。"
    },
    
    '借款实际交付金额1（元）' : { 
        "keyword": ["元"], 
        "warning": "是实际上原告给被告的金额，不要和约定的借款金额混淆。单位为元，例如若为50万元，需要转换为500000元的形式。"
    },
    '借款实际交付时间1' : { 
        "keyword": ["年", "月"], 
        "warning":  "请重点关注上下文中具备年-月-日格式的部分。是实际上原告把钱给被告的日期，不要和其他的日期混淆。"
    },
  
    '已还款时间1' : { 
        "keyword": ["年", "月", "还"], 
        "warning":  "请重点关注上下文中具备年-月-日格式的部分。是被告还钱给原告的日期，不要和其他日期混淆。"
    },
    '已还款金额1（元）' : { 
        "keyword": ["元", "还"], 
        "warning": "是被告第一次实际还给原告的金额，不要和其他金额混淆。单位为元，例如若为50万元，需要转换为500000元的形式。"
    },
}

# 实际使用的字段
Actually_used_attributes = OrderedDict({
    "姓名名称" : value_range["字符串"],
    # 诉讼请求
    "需返回本金总额（元）" : value_range["金额"],
    '需返回利息总额（元）' : value_range["金额"],
    '需返回利息计算起始日期' : value_range["日期值"],
    '需返回利息计算截止日期' : value_range["日期值"],
    '需返还利息率数值（百分比或元）' : value_range["率数值"],
    '需返回违约金总额（元）' : value_range["金额"],
    '需返回违约金计算起始日期' : value_range["日期值"],
    '需返回违约金计算截止日期' : value_range["日期值"],
    '需返还违约金数值（百分比或元）' : value_range["率数值"],
})

"""
'需返回逾期利息总额（元）' : value_range["金额"],
'需返回逾期利息计算起始日期' : value_range["日期值"],
'需返回逾期利息计算截止日期' : value_range["日期值"],
'需返还逾期利息率数值（百分比或元）' : value_range["率数值"],
"""