from collections import OrderedDict

_ROLE = ["出借人（原告）", "借款人（被告）", "担保人（被告）", "其他诉讼参与人"]
_CONTENTS = ["原文", "取值"]

# 记录表格中有哪些角色（列表），表格多少行（整数），每个角色的名称、原文列号：字典（主体：二元组）

_OVERALL = OrderedDict(
    {
    "主体列表": None,
    "行数":None, 
    "主体信息":None
}
)

# 格式固定，从最开始采集就行:
_COLLECTION = OrderedDict()

# 特定于每个角色，每个角色都有借贷关系角色和一个相关诉讼参与人字典（index: {"姓名":{"原文":None, "取值":None}}）
_PROCEDURE = OrderedDict({
    "借贷关系角色":None,
    "相关诉讼参与人":{
        "数字":{
            "姓名":None,
            "出庭情况":None
        }
    }
})

# 特定于每个角色， 原文就遍历原文列号就行、{"原文":None, "取值":None}、实体1、实体2
_REQUEST_JUDGEMENT = OrderedDict({
    "【诉讼请求原文】【法院认为及判决结果原文】":None,
    "是否变更诉讼请求":None,
    "需返回本金总额（元）":None,
    "需返回利息":{
        "数字":{
            "总额（元）":None,
            "计算起始日期":{
                "数字":{
                    "日期":None,
                    "日期类型":None,
                }
            },
            "计算截止日期":None,
            "计算截止日期类型":None,
            "利息率类型":None,
            "利息率数值（百分比或元）":None
        }
    },
    "需返回逾期利息":{
        "数字":{
            "总额（元）":None,
            "计算起始日期":None,
            "计算起始日期类型":None,
            "计算截止日期":None,
            "计算截止日期类型":None,
            "利息率类型":None,
            "利息率数值（百分比或元）":None
        }
    },
    "需返回违约金":{
        "数字":{
            "总额（元）":None,
            "计算起始日期":None,
            "计算起始日期类型":None,
            "计算截止日期":None,
            "计算截止日期类型":None,
            "违约金类型":None,
            "违约金数值（百分比或元）":None
        }
    },
    "担保责任":{
        "数字":{
            "是否承担":None,
        "承担保证责任的人或单位名称": None,
        "保证责任类型":None
        }
    },
    "需返回债权实现费用":{
        "起诉前":{
            "总额":None, 
            "类型":None
        },
        "起诉后":{
            "总额":None, 
            "类型":None
        }
    }
})

# 特定于每个角色，可迭代对象以index:对象为键值对
_REALIRT_ARGUE = OrderedDict({
    "【事实与理由原文】【辩称原文】【法院认定事实原文】":None,
    "借款目的与用途类型":None,
    "借款人与出借人关系类型":None,
    "担保人的姓名或单位名称":None,
    "借款人与担保人关系类型":None,
    "意思表示日":None,
    "借款次数":None,
    "借款次数情况":None,
    "是否有借款凭证":None,
    "借款凭证":{               # 为None则没有，有则非None。内含可迭代借款凭证对象
        "数字":{
            "名称":None,
            "类型":None,
            "出具时间":None,
            "所载内容":None
        }
    },
    "约定的借款金额":{
        "数字":{
            "约定情况":None,
            "实际发生时间":None,
            "金额（元）":None,
        }
    },
    "约定的还款日期或借款期限":{
        "数字":{
            "约定情况":None,
            "实际发生时间":None,
            "借款起始日期":None,
            "还款日期":None,
            "借款期限（月）":None
        }
    },
    "约定的利息":{
        "数字":{
            "约定情况":None,
            "实际发生时间":None,
            "利率类型":None,
            "利率数值（百分比或元）":None
        }
    },
    "约定的逾期利息":{
        "数字":{
            "约定情况":None,
            "实际发生时间":None,
            "利率类型":None,
            "利率数值（百分比或元）":None
        }
    },
    "约定的违约金":{
        "数字":{
            "约定情况":None,
            "实际发生时间":None,
            "违约金类型":None,
            "违约金数值（百分比或元）":None
        }
    },
    "管辖约定情况":None,
    "仲裁约定情况":None,
    "程序性费用的承担（律师费、诉讼费等）":{
        "约定情况":None,
        "约定的承担情况类型":None
    },
    "约定的还款方式":{
        "数字":{
            "约定情况":None,
            "实际发生时间":None,
            "本金还款方式":None,
            "利息还款方式":None,
            "前述还款方式下每次还款总金额（元）":None,
            "前述还款方式下每次还款日期":None
        }
    },
    "约定的担保":{
        "数字":{
            "约定情况":None,
            "实际发生时间":None,
            "担保方式类型":None,
            "担保范围":None,
            "担保期限（月）":None,
            "担保物当下状态":None,
            "担保人类型": None,
            "保证责任类型":None
        }
    },
    "借款实际交付":{
        "数字":{
            "金额（元）":None,
            "时间":None,
            "方式类型":None,
            "所对应的是第几笔借款":None
        }
    },
    "已还款总体情况类型":None,
    "已还款":{
        "数字":{
            "时间":None,
            "金额（元）":None,
            "方式":None,
            "金额性质":None,
            "对应的是第几笔借款":None,
            "所冲抵利息至哪一日":None,
        }
    },
    "【当事人提供的所有证据原文】或【反映认定的所有证据原文】":None
})

# 特定于每个角色，
_SPECIAL = OrderedDict({
    "夫妻共同债务":{
        "法院认定":None,
        "说理原文":None
    },
    "砍头息":{
        "法院认定":None,
        "说理原文":None
    },
    "公司为股东担保":{
        "法院认定":None,
        "说理原文":None
    },
    "债权/债务非原始取得":{
        "债权取得类型":None,
        "转让人":None,
        "继受人":None,
    },
    "出借人主体资格问题":{
        "法院认定":None,
        "说理原文":None
    },
    "职业放贷人":{
        "法院对效力的认定":None,
        "承担举证责任方":None,
        "说理原文":None
    },
    "互联网平台责任":{
        "法院认定":None,
        "说理原文":None
    },
    "民刑交叉":{
        "法院处理程序":None,
        "说理原文":None
    },
    "利率调整、认定":{
        "法院关于利率的调整、认定等事项的说理原文":None
    }
})


_STRUCTUER = [
    ( '总体信息', _OVERALL ),
    ( '采集信息', _COLLECTION ), 
    ( '程序信息', _PROCEDURE ), 
    ( '【诉讼请求】【法院认为及判决结果】',_REQUEST_JUDGEMENT ), 
    ( '【事实与理由】【辩称】【法院认定事实】',_REALIRT_ARGUE ), 
    ( '专题问题',_SPECIAL )
]